microchip-pic-avr-examples/dspic33ak512mps506-curiosity-nano-oob-demo/osc.c
/*************************************************************************
 *  © 2025 Microchip Technology Inc.
 *
 *  Project Name:   dsPIC33AK512MPS506 Curiosity Nano Demo
 *  FileName:       osc.c
 * 
 * ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
 * 
 *  Description: This header contains UART functions declarations.
 *
 *************************************************************************/
/**************************************************************************
 * MICROCHIP SOFTWARE NOTICE AND DISCLAIMER: You may use this software, and
 * any derivatives created by any person or entity by or on your behalf,
 * exclusively with Microchip's products in accordance with applicable
 * software license terms and conditions, a copy of which is provided for
 * your reference in accompanying documentation. Microchip and its licensors
 * retain all ownership and intellectual property rights in the
 * accompanying software and in all derivatives hereto.
 *
 * This software and any accompanying information is for suggestion only.
 * It does not modify Microchip's standard warranty for its products. You
 * agree that you are solely responsible for testing the software and
 * determining its suitability. Microchip has no obligation to modify,
 * test, certify, or support the software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER
 * EXPRESS, IMPLIED OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED
 * WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND FITNESS FOR A
 * PARTICULAR PURPOSE APPLY TO THIS SOFTWARE, ITS INTERACTION WITH
 * MICROCHIP'S PRODUCTS, COMBINATION WITH ANY OTHER PRODUCTS, OR USE IN ANY
 * APPLICATION.
 *
 * IN NO EVENT, WILL MICROCHIP BE LIABLE, WHETHER IN CONTRACT, WARRANTY,
 * TORT (INCLUDING NEGLIGENCE OR BREACH OF STATUTORY DUTY), STRICT
 * LIABILITY, INDEMNITY, CONTRIBUTION, OR OTHERWISE, FOR ANY INDIRECT,
 * SPECIAL, PUNITIVE, EXEMPLARY, INCIDENTAL OR CONSEQUENTIAL LOSS, DAMAGE,
 * FOR COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE,
 * HOWSOEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY
 * OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT ALLOWABLE BY LAW,
 * MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS
 * SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID
 * DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * MICROCHIP PROVIDES THIS SOFTWARE CONDITIONALLY UPON YOUR ACCEPTANCE OF
 * THESE TERMS.
 *************************************************************************/


#include "xc.h"

void OSCInit(){
    PLL1CONbits.ON = 1;
    OSCCTRLbits.PLL1EN = 1;
    while (OSCCTRLbits.PLL1RDY == 0UL);
    PLL1CONbits.FSCMEN = 0; // disable clock fail monitor

    VCO1DIVbits.INTDIV = 1; // 1:2 = 320MHz

    PLL1DIVbits.PLLFBDIV = 80; // VCO = 640 MHz
    PLL1DIVbits.PLLPRE = 1;
    PLL1DIVbits.POSTDIV1 = 4; // 1:4 = 160 MIPS
    PLL1DIVbits.POSTDIV2 = 1;

    PLL1CONbits.DIVSWEN = 1;
    while (PLL1CONbits.DIVSWEN == 1);

    PLL1CONbits.NOSC = 1; // FRC

    PLL1CONbits.OSWEN = 1;
    while (PLL1CONbits.OSWEN == 1);

    PLL1CONbits.FOUTSWEN = 1;
    while (PLL1CONbits.FOUTSWEN == 1);
    PLL1CONbits.PLLSWEN = 1;
    while (PLL1CONbits.PLLSWEN == 1);

    while (PLL1CONbits.CLKRDY == 0);
    
    // PLL2 initialization
    PLL2CONbits.ON = 1;
    OSCCTRLbits.PLL2EN = 1;
    while(OSCCTRLbits.PLL2RDY == 0);
    PLL2CONbits.FSCMEN = 1; // disable clock fail monitor
    
    VCO2DIVbits.INTDIV = 1; // 1:2 = 320MHz
    
    PLL2DIVbits.PLLFBDIV = 80; // VCO = 640 MHz
    PLL2DIVbits.PLLPRE = 1;
    PLL2DIVbits.POSTDIV1 = 4;
    PLL2DIVbits.POSTDIV2 = 4;

    PLL2CONbits.DIVSWEN = 1;
    while(PLL2CONbits.DIVSWEN == 1);    
    
    PLL2CONbits.NOSC = 1; // FRC
    PLL2CONbits.OSWEN = 1;
    while(PLL2CONbits.OSWEN == 1);        

    PLL2CONbits.FOUTSWEN = 1;
    while(PLL2CONbits.FOUTSWEN == 1);
    PLL2CONbits.PLLSWEN = 1;
    while(PLL2CONbits.PLLSWEN == 1);
  
    while(PLL2CONbits.CLKRDY == 0);
    
    // CPU clock to PLL 
    CLK1CONbits.NOSC = 5; // PLL1
    CLK1CONbits.OSWEN = 1;
    while (CLK1CONbits.OSWEN == 1);
    while (CLK1CONbits.CLKRDY == 0);

}
